#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//
//int main()
//{
//	int a = 7 % 2;//7/2...1
//	int b = 7 / 2;
//	printf("%d\n", a);//1
//	printf("%d\n", b);//1
//
//	return 0;
//}
//% 取模操作符的两端必须是整数
//

//C语言深度解剖 - 蛋哥
//讲到了
//13
//16进制
//0~9 a~f
//0~9 10~15
//10进制
//0~9
//
//2进制
//0~1
// 
//8进制
//0~7
// 

//整数的二进制表示有3种
//原码
//反码
//补码

//
//正的整数的原码、反码、补码相同
//负的整数的原码、反码、补码是要计算的
//
//7
//00000000000000000000000000000111 - 原码
//00000000000000000000000000000111 - 反码
//00000000000000000000000000000111 - 补码

//-7
//10000000000000000000000000000111 - 原码
//11111111111111111111111111111000 - 反码（原码的符号位不变，其他位按位取反就是反码）
//11111111111111111111111111111001 - 补码（反码+1就是补码）
//
//整数在内存中存储的是补码
//
//
//int main()
//{
//	int a = 7;
//	//
//	//左移操作符
//	//移动的是二进制位
//	//
//	int b = a << 1;
//	
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//	return 0;
//}


//int main()
//{
//	int a = -7;
//	//
//	//左移操作符
//	//移动的是二进制位
//	//
//	int b = a << 1;
//
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//	return 0;
//}

//int main()
//{
//	//float f = 3.14f;
//	//float f2 = f << 1;//不支持
//
//
//	return 0;
//}

//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//	
//	int c = a >> -2;//err
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);
//
//	return 0;
//}

