#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


// & - 按（2进制）位与
// | - 按（2进制）位或
// ^ - 按（2进制）位异或 - 相同为0，相异以1

//
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//	//00000000000000000000000000000011 - 3的补码
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 - -5的补码
//	//00000000000000000000000000000011 - 3的补码
//	//11111111111111111111111111111000
//	//11111111111111111111111111110111
//	//10000000000000000000000000001000
//	//
//	//%d 意味着打印一个有符号的整数
//	//
//	printf("c=%d\n", c);
//
//	return 0;
//}


//
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b;
//	//00000000000000000000000000000011 - 3的补码
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 - -5的补码
//	//00000000000000000000000000000011 - 3的补码
//	//11111111111111111111111111111011
//	//11111111111111111111111111111010
//	//10000000000000000000000000000101
//	//-5
//	//%d 意味着打印一个有符号的整数
//	//
//	printf("c=%d\n", c);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	//00000000000000000000000000000011 - 3的补码
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 - -5的补码
//	//00000000000000000000000000000011 - 3的补码
//	//00000000000000000000000000000011
//	//
//	//%d 意味着打印一个有符号的整数
//	//
//	printf("c=%d\n", c);
//
//	return 0;
//}



//不能创建临时变量（第三个变量），实现两个数的交换。

//3^3 = 0 -> a^a=0
//011
//011
//000
//0^5=5 -> 0^a = a
//000
//101
//101

//3^3^5 = 5
//3^5^3 = 5
//异或操作符支持交换律
//011
//101
//110
//011
//101

//
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a ^ b;//a=3^5
//	b = a ^ b;//3^5^5 --> b=3
//	a = a ^ b;//3^5^3 --> a=5
//
//	printf("交换后：a=%d b=%d\n", a, b);
//
//	return 0;
//}

// 
//int main()
//{
//	int a = 3;
//	int b = 5;
//  //这种方法会有溢出的问题
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后：a=%d b=%d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;//空瓶
//
//	printf("交换前：a=%d b=%d\n", a, b);
//	c = a;
//	a = b;
//	b = c;
//	printf("交换后：a=%d b=%d\n", a, b);
//
//	return 0;
//}

//
//编写代码实现：求一个整数存储在内存中的二进制中1的个数
//求补码的二进制中1的个数
//
//int a = 3;
//00000000000000000000000000000011
//
//a&1
//00000000000000000000000000000011
//00000000000000000000000000000001
//00000000000000000000000000000001
//>> <<
//

//int main()
//{
//	int a = 3;//初始化
//
//	int b = 0;
//	b = 20;//赋值
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	a = a + 5;
//	a += 5;
//
//	a = a >> 1;
//	a >>= 1;
//
//
//	return 0;
//}

//int main()
//{
//	int flag = 3;
//	//flag为真,进入if
//	if (flag)
//	{}
//	
//	//flag为假,进入if
//	if(!flag)
//	{}
//
//	return 0;
//}

//
//C语言中0表示假，非0表示真
//


//int main()
//{
//	//int a = -10;
//	//int b = -a;
//	//printf("%d\n", a); 
//	//printf("%d\n", b);
//
//	int a = 10;
//	printf("%p\n",  &a);
//	int* p = &a;//p就是指针变量
//
//	return 0;
//}
//
//int main()
//{
//	int arr[5] = {0};
//	printf("%d\n", sizeof(arr));
//
//	//int a = 10;
//	////int n = sizeof(a);//计算的是a所占内存的大小，单位是字节
//	//int n = sizeof(int);
//	////sizeof是一个操作符
//	////计算的是变量所占内存空间的大小,单位是字节
//	////计算类型所创建的变量占据空间的大小,单位是字节
//	////
//	//printf("n=%d\n", n);
//
//	return 0;
//}
//
//int main()
//{
//	//int a = 0;
//	////~ 是按二进制位取反
//	////00000000000000000000000000000000 - 补码
//	////11111111111111111111111111111111 -> ~a
//	////11111111111111111111111111111110
//	////10000000000000000000000000000001
//	////-1
//	//printf("%d\n", ~a);//-1
//
//	//int a = 3;
//	////00000000000000000000000000000011
//	////11111111111111111111111111111100 - 补码
//	////11111111111111111111111111111011
//	////10000000000000000000000000000100
//	////-4
//	//printf("%d\n", ~a);
//
//	int a = 13;
//	a |= (1 << 4);
//	printf("%d\n", a);//a=29
//	a &= (~(1 << 4));
//	printf("%d\n", a);//a=13
//
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//00000000000000000000000000001101
//
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000
//	//
//	//00000000000000000000000000001101
//	//00000000000000000000000000011101
//	//00000000000000000000000000000010
//	//1<<1
//	//00000000000000000000000000001111
//	//
//	return 0;
//}
//
//void test(int n)
//{}
//int main()
//{
//	//int a = 3;
//	////int b = ++a;//前置++，先++，后使用
//	////a=a+1,b=a;
//	//int b = a++;//后置++，先使用，再++
//	////b=a, a=a+1
//	//printf("%d\n", a);//
//	//printf("%d\n", b);//
//
//	//int a = 3;
//	//int b = a--;
//	////b=a,a=a-1
//	////int b = --a;//前置--，先--，后使用
//	////a=a-1,b=a
//	//printf("%d\n", a);//2
//	//printf("%d\n", b);//3
//
//	//int a = 10;
//	//printf("%d\n", a--);//?
//	//printf("%d\n", a);//?
//
//	int a = 10;
//	test(a--);
//
//	return 0;
//}

//int main()
//{
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//
//	}
//	for (i = 0; i < 10; ++i)
//	{
//
//	}
//
//	return 0;
//}
//
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//	printf("%d\n", a);
//
//	return 0;
//}
//


//int main()
//{
//	//time_t;//long long
//	srand((unsigned int)time(NULL));
//	int a = (int)3.14;
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//
//	printf("%d\n", sizeof a);//ok
//
//	//printf("%d\n", sizeof int);//err
//
//	return 0;
//}

//sizeof是操作符，不是函数
//strlen是库函数，是用来求字符串长度


//int main()
//{
//	if (3 == 5)
//	{
//	}
//	//err
//	if ("abc" == "abcdef")//这样写是在比较2个字符串的首字符的地址
//	{
//
//	}
//  //两个字符串比较相等应该使用strcmp
//	return 0;
//}
//
//int main()
//{
//	int a = 0;
//	int b = 0;
//	//int c = a && b;//并且
//
//	int c = a || b;  //或者
//
//	printf("%d\n", c);
//
//	//if (a && b)
//	//{
//
//	//}
//	return 0;
//}

//1. 能被4整除，并且不能被100整除
//2. 能被400整除是闰年
//
//int is_leap_year(int y)
//{
//	if (((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0))
//	{
//		return 1;
//	}
//	else
//	{
//		return 0;
//	}
//}
//
//int main()
//{
//	return 0;
//}

//
//&& 左边为假，右边就不计算了
//|| 左边为真，右边就不计算了
//
//#include <stdio.h>
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//
//	i = a++ || ++b || d++;
//
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//
//	return 0;
//}
//
//int main()
//{
//	int a = 3;
//	int b = 0;
//	
//	int max = (a > b ? a : b);
//
//	if (a > 5)
//		b = 3;
//	else
//		b = -3;
//	
//	(a > 5) ? (b = 3) : (b = -3);
//
//	b = (a > 5 ? 3 : -3);
//
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);
//	printf("c=%d\n", c);
//	return 0;
//}
//
//int main()
//{
//	int arr[10] = { 0 };
//	//
//	//arr[7] --> *(arr+7) --> *(7+arr) --> 7[arr]
//	// 
//	//arr是数组首元素的地址
//	//arr+7就是跳过7个元素，指向了第8个元素
//	//*(arr+7) 就是第8个元素
//	//
//	arr[7] = 8;
//	7[arr] = 9;
//
//
//	//[] arr 7
//	//3 + 5;
//	//5 + 3;
//	return 0;
//}


//函数定义
//int Add(int x, int y)
//{
//	return x + y;
//}
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int c = Add(a, b);//() 就是函数调用操作符,操作数：Add,a,b
//	//
//	//sizeof a;
//
//	return 0;
//}

#include <string.h>

struct Stu
{
	char name[20];
	int age;
	double score;
};

void set_stu(struct Stu* ps)
{
	//strcpy((*ps).name, "zhangsan");
	//(*ps).age = 20;
	//(*ps).score = 100.0;

	strcpy(ps->name, "zhangsan");
	ps->age = 20;
	ps->score = 100.0;
}

void print_stu(struct Stu* ps)
{
	printf("%s %d %lf\n", ps->name, ps->age, ps->score);
}

int main()
{
	struct Stu s = {0};
	set_stu(&s);
	print_stu(&s);

	return 0;
}